An enumerated type listing all the reasons for connectivity failure.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
  Since:  2016
 Syntax
  C#
public enum ConnectionWarning
  Visual Basic
Public Enumeration ConnectionWarning
  Visual C++
public enum class ConnectionWarning
 Members
  Member name  |   Description
   Unknown   |   Value for unknown or unspecified reason.
   Alignment   |   Value for parts were moved when rebuilt so that connectors were no longer aligned.
   Size   |   Value for sizes didn't match.
   Shape   |   Value for shapes didn't match.
   Connectivity   |   Value for fabrication Connectivity Mismatch.
 See Also
  Autodesk.Revit.DB Namespace